---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondaryWarn
source: html/88a11273-7d05-76e7-9613-0de1b5335d13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondaryWarn Property

No element in a secondary Option can be referenced by an element outside that Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadReferenceToSecondaryWarn { get; }
```